# Step 1: Importing the libraries

In [1]:
import pandas as pd
import numpy as np

# Step 2: Importing dataset

In [7]:
df = pd.read_csv('Data.csv')
df.head()

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes

In [14]:
df.shape

(10, 4)

# Step 3: Handling the missing data

In [8]:
df.isnull().sum()

Country      0
Age          1
Salary       1
Purchased    0
dtype: int64

In [9]:
df['Age'] = df['Age'].fillna(df['Age'].median())
df['Salary'] = df['Salary'].fillna(df['Salary'].median())

In [10]:
df.isnull().sum()

Country      0
Age          0
Salary       0
Purchased    0
dtype: int64

# Step 4: Encoding categorical data

In [11]:
df['Country'].value_counts()

France     4
Spain      3
Germany    3
Name: Country, dtype: int64

In [12]:
df1 = pd.get_dummies(df, drop_first=True)

In [13]:
df1.head()

    Age   Salary  Country_Germany  Country_Spain  Purchased_Yes
0  44.0  72000.0                0              0              0
1  27.0  48000.0                0              1              1
2  30.0  54000.0                1              0              0
3  38.0  61000.0                0              1              0
4  40.0  61000.0                1              0              1

# Step 5: Creating a dummy variable

In [16]:
X = df1.drop('Purchased_Yes', axis=1)
y = df1['Purchased_Yes']

# Step 6: Splitting the datasets into training sets and Test sets

In [17]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=0.20, random_state=0)

In [22]:
X_train.head()

    Age   Salary  Country_Germany  Country_Spain
4  40.0  61000.0                1              0
9  37.0  67000.0                0              0
1  27.0  48000.0                0              1
6  38.0  52000.0                0              1
7  48.0  79000.0                0              0

In [23]:
X_test.head()

    Age   Salary  Country_Germany  Country_Spain
2  30.0  54000.0                1              0
8  50.0  83000.0                1              0

In [24]:
y_train.head()

4    1
9    1
1    1
6    0
7    1
Name: Purchased_Yes, dtype: uint8

In [25]:
y_test.head()

2    0
8    0
Name: Purchased_Yes, dtype: uint8

# Step 7: Feature Scaling

In [19]:
from sklearn.preprocessing import StandardScaler
scaler = StandardScaler()
scaler1 = scaler.fit_transform(X_train, y_train)